---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs
source: html/f0cf9312-ba3a-24fa-5289-f5a8e860b66d.htm
---
# ExternalDataInstanceAddedIntoDocumentEventArgs Methods

Indicates whether the event is being cancelled.